const memories = [
    {
        date: '2023年12月2日',
        title: '我的节日，我们的节日',
        description: '这天是我们相识100天纪念日，同时也是你陪我度过的第一个生日，我很开心，也很幸福，可能就是那天，让我们对彼此有了更高的好感，为后来彼此的相爱打下了基础。我永远记得那天，我永远记得你，我永远爱你。',
        images: [
            {
                src: 'images/2023年12月/2023年12月2日/20231202-1.png',
                caption: '美好时刻 1'
            },
            {
                src: 'images/2023年12月/2023年12月2日/20231202-2.png',
                caption: '美好时刻 2'
            },
            {
                src: 'images/2023年12月/2023年12月2日/20231202-3.png',
                caption: '美好时刻 3'
            },
            {
                src: 'images/2023年12月/2023年12月2日/20231202-4.png',
                caption: '美好时刻 4'
            }
        ]
    },
    {
        date: '2024年1月24日',
        title: '游戏时光，有你便好',
        description: '我们在跑酷途中，停在一个热气球前，一起欣赏着日落；在树屋前欣赏花海；在路牌前拍下了照片，记录下我们的美好瞬间；还乘着马车，走在繁华的街上，我多希望时间能慢一点，再慢一点',
        images: [
            {
                src: 'images/2024年1月/2024年1月24日/20240124-1.png',
                caption: '云顶漫步'
            },
            {
                src: 'images/2024年1月/2024年1月24日/20240124-2.png',
                caption: '花海街拍'
            },
            {
                src: 'images/2024年1月/2024年1月24日/20240124-3.png',
                caption: '花海街拍'
            },
            {
                src: 'images/2024年1月/2024年1月24日/20240124-4.png',
                caption: '花海街拍'
            },
            {
                src: 'images/2024年1月/2024年1月24日/20240124-5.png',
                caption: '隔桥相望'
            },
            {
                src: 'images/2024年1月/2024年1月24日/20240124-6.png',
                caption: '落日对望'
            },
            {
                src: 'images/2024年1月/2024年1月24日/20240124-7.png',
                caption: '月初闪耀'
            }
        ]
    },
    {
        date: '2024年2月3日',
        title: '双人乐趣',
        description: '我们一起游玩我的地图，我触发了一个规则，导致我变成了你的样子，我们一起游玩了更深层的内容，特别开心',
        images: [
            {
                src: 'images/2024年2月/2024年2月3日/20240203-1.png',
                caption: '新春装饰'
            },
        ]
    },
    {
        date: '2024年2月21日',
        title: '共同巡查，双生双栖',
        description: '我们一起在地图里巡查，一起探索未知的世界。每一次相遇，都是我们共同成长的机会，每一次对话，都使得我们的感情更进一步。',
        images: [
            {
                src: 'images/2024年2月/2024年2月21日/20240221-1.jpg',
                caption: '双柳抱日'
            },
            {
                src: 'images/2024年2月/2024年2月21日/20240221-2.png',
                caption: '仙君共赴'
            },
            {
                src: 'images/2024年2月/2024年2月21日/20240221-3.jpg',
                caption: '双生双栖'
            },
        ]
    },
    {
        date: '2024年2月25日',
        title: '纯真的爱',
        description: '在这个阳光明媚的日子，我们来到风景如画的地方，记录下最美的瞬间。每一帧都定格了我们的幸福笑容。',
        images: [
            {
                src: 'images/2024年2月/2024年2月25日/20240225-1.png',
                caption: '生存共房'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-1.png',
                caption:'花棚01'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-2.png',
                caption:'花棚02'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-3.png',
                caption:'花棚03'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-4.png',
                caption:'花棚04'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-5.png',
                caption:'阳台美景'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-6.png',
                caption:'房顶夜色近景'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-7.png',
                caption:'房顶夜色远景'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-8.png',
                caption:'房顶夜色远景侧方'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-9.png',
                caption:'房顶夜色远景后方'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-10.png',
                caption:'房顶夜色远景右侧方'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-11.png',
                caption:'房顶夜色近景侧方'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-12.png',
                caption:'阳台夜景'
            },
            {
                src: 'images/2024年2月/2024年2月25日/20240225（景色）-13.png',
                caption:'阳台白天近景'
            },
            {
                src: 'images/2V24年2月/2024年2月25日/20240225（景色）-14.png',
                caption:'屋顶白天远景'
            },
        ]
    },
    {
        date: '2024年3月2日',
        title: '落日的美景',
        description: '三月的春风带来了温暖，我们漫步在平原，感受着大自然的生机。每一朵绽放的花都是对美好生活的赞美。；我们摆着动作，记录下我们幸福的一天',
        images: [
            {
                src: 'images/2024年3月/2024年3月2日/20240302-1.png',
                caption: '左前'
            },
            {
                src: 'images/2024年3月/2024年3月2日/20240302-2.png',
                caption: '正前'
            },
            {
                src: 'images/2024年3月/2024年3月2日/20240302-3.png',
                caption: '左前'
            },
            {
                src: 'images/2024年3月/2024年3月2日/20240302-4.png',
                caption: '正前'
            }
        ]
    },
    {
        date: '2024年3月9日',
        title: '跑酷的快乐',
        description: '我们跑跳在游戏中，感受着彼此的温度。每一次跳跃，都是我们互相鼓励的机会，每一次碰撞，都让我们更加亲密。',
        images: [
            {
                src: 'images/2024年3月/2024年3月9日/20240309-1.png',
                caption: '春日漫步'
            },
            {
                src: 'images/2024年3月/2024年3月9日/20240309-2.png',
                caption: '春日漫步'
            }
        ]
    },
    {
        date: '2024年3月29日',
        title: '空岛比心',
        description: '在这个特殊的日子，我们在一个空岛上，享受着彼此的靠近带来的独特感觉。',
        images: [
            {
                src: 'images/2024年3月/2024年3月29日/20240329-1.png',
                caption: '甜蜜约会'
            }
        ]
    },
    {
        date: '2024年3月30日',
        title: '浪漫的邂逅',
        description: '我们在一个浪漫的跑酷，一起伴随彼此前行，地图里有那么多的美景，可在我眼中，它们都不及你一丝一毫，我的眼中只有你',
        images: [
            {
                src: 'images/2024年3月/2024年3月30日/20240330-1.png',
                caption: '浪漫邂逅'
            },
            {
                src: 'images/2024年3月/2024年3月30日/20240330-2.png',
                caption: '浪漫邂逅'
            },
            {
                src: 'images/2024年3月/2024年3月30日/20240330-3.png',
                caption: '浪漫邂逅'
            },
            {
                src: 'images/2024年3月/2024年3月30日/20240330-4.png',
                caption: '浪漫邂逅'
            }
        ]
    },
    {
        date: '2024年4月7日',
        title: '你的节日，我们的节日',
        description: '这天是你的生日，我们一起游戏，度过了一个难忘的节日',
        images: [
            {
                src: 'images/2024年4月/2024年4月7日/20240407-1.png',
                caption: '浪漫邂逅'
            }
        ]
    },
    {
        date: '2024年4月12日',
        title: '日落展翅',
        description: '我们在日落图中，展开了属于我们的翅膀，有了属于我们的自由，无需在意他人的眼光，共同分享属于我们的快乐',
        images: [
            {
                src: 'images/2024年4月/2024年4月12日/20240412-1.png',
                caption: '春日漫步'
            },
            {
                src: 'images/2024年4月/2024年4月12日/20240412-2.png',
                caption: '野趣时光'
            }
        ]
    },
    {
        date: '2024年6月10日',
        title: '完美的默契度',
        description: '这一天，我们的挚友默契度达到了5200，这个数字对我们来说意义重大',
        images: [
            {
                src: 'images/2024年6月/2024年6月10日/20240610-1.png',
                caption: ' 默契度截图'
            }
        ]
    },
    {
        date: '2024年7月1日',
        title: '花海漫步',
        description: '在这个盛夏，我们一起漫步在花海中，每一朵花都见证着我们的甜蜜时光。',
        images: [
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-1.jpg',
                caption: '花海合影'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-2.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-3.jpg',
                caption: '幸福瞬间'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-4.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-5.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-6.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-7.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-8.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-9.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-10.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/柳儿视角/20240701-花海-柳-11.jpg',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-1.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-2.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-3.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-4.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-5.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-6.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-7.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-8.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-9.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-10.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-11.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-12.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-13.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-14.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-15.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-16.png',
                caption: '浪漫时刻'
            },
            {
                src: 'images/2024年7月/2024年7月1日-花海景色合照合集/自视角/20240701-花海-我-17.png',
                caption: '浪漫时刻'
            }
        ]
    },
    {
        date: '2024年7月6日',
        title: '浪漫的邂逅',
        description: '我们在极寒冰地里，看着天上的极光，仿佛在等待我们的到来。',
        images: [
            {
                src: 'images/2024年7月/2024年7月6日/20240706-1.png',
                caption: '浪漫邂逅'
            }
        ]
    },
    {
        date: '2024年7月16日',
        title:"我们的家",
        description: '那天我们一起拍摄了这张图片，仿佛我们真的成为了一家人，我多希望这一切能成真哇',
        images: [
            {
                src: 'images/2024年7月/2024年7月16日/20240716-1.png',
                caption: '浪漫邂逅'
            }
        ]
    },
    {
        date: '2024年7月27日',
        title: '天使的出现',
        description: '我收到了你送的安琪儿，我们一起在那张跑酷图中拍下了这张照片，它仿佛有无尽的救赎感，深入了我的内心',
        images: [
            {
                src: 'images/2024年7月/2024年7月27日/20240727-1.png',
                caption: '浪漫邂逅'
            },
            {
                src: 'images/2024年7月/2024年7月27日/20240727-2.png',
                caption: '浪漫邂逅'
            }
        ]
    },
    {
        date: '2024年8月24日',
        title: '甜蜜之恋',
        description: '那天我们在一起玩了把人拉过来这个地图，最初的时候我们在互相打闹，而后来我们则是做了许多暧昧的动作；后来我们去玩了小镇，虽然异常的卡顿，但是我们玩的还开心，我抱着你去了我的房子，有许多的人在围观',
        images: [
            {
                src: 'images/2024年8月/2024年8月24日/20240824-1.png',
                caption: '浪漫晚餐'
            },
            {
                src: 'images/2024年8月/2024年8月24日/20240824-2.png',
                caption: '甜蜜时光'
            },
            {
                src: 'images/2024年8月/2024年8月24日/20240824-3.png',
                caption: '幸福合影'
            },
            {
                src: 'images/2024年8月/2024年8月24日/20240824-4.png',
                caption: '甜蜜时刻'
            },
            {
                src: 'images/2024年8月/2024年8月24日/20240824-5.png',
                caption: '甜蜜时刻'
            },
            {
                src: 'images/2024年8月/2024年8月24日/20240824-6.png',
                caption: '甜蜜时刻'
            },
            {
                src: 'images/2024年8月/2024年8月24日/20240824-7.png',
                caption: '甜蜜时刻'
            }
        ]
    },
    {
        date: '2024年8月10日',
        title: '七夕邂逅',
        description: '在这个特殊的日子，我们在我的日落中，享受着彼此的靠近带来的独特感觉。',
        images: [
            {
                src: 'images/2024年8月/2024七夕/2024七夕-1.png',
                caption: '甜蜜约会'
            },
            {
                src: 'images/2024年8月/2024七夕/2024七夕-2.png',
                caption: '甜蜜约会'
            },
            {
                src: 'images/2024年8月/2024七夕/2024七夕-3.png',
                caption: '甜蜜约会'
            },
            {
                src: 'images/2024年8月/2024七夕/2024七夕-4.png',
                caption: '甜蜜约会'
            },
            {
                src: 'images/2024年8月/2024七夕/2024七夕-5.png',
                caption: '甜蜜约会'
            }
        ]
    },
    {
        date: '2024年9月21日',
        title: '美丽风景，因你而有色彩',
        description: '秋高气爽的日子，我们来到郊外欣赏秋日风光。金黄的落叶、清爽的微风，还有你的笑容，构成了最美的秋日画卷。',
        images: [
            {
                src: 'images/2024年9月/2024年9月21日-景色/20240921-1.png',
                caption: '秋日风景'
            },
            {
                src: 'images/2024年9月/2024年9月21日-景色/20240921-2.png',
                caption: '秋色如画'
            },
            {
                src: 'images/2024年9月/2024年9月21日-景色/20240921-3.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年9月/2024年9月21日-景色/20240921-4.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年9月/2024年9月21日-景色/20240921-5.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年9月/2024年9月21日-景色/20240921-6.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年9月/2024年9月21日-景色/20240921-7.png',
                caption: '温馨时刻'
            },
        ]
    },
    {
        date: '2024年10月4日',
        title: '我们的一家',
        description: '那天我们在小镇，一个人扮演父亲，另一个人扮演母亲，我们三个人像是一家人，那么温馨，那么美好',
        images: [
            {
                src: 'images/2024年10月/2024年10月4日/20241004-1.png',
                caption: '温馨时刻'
            },
        ]
        },
    {
        date: '2024年11月29日',
        title: '心与心的链接',
        description: '我们一起在心链空间拍下了这张照，我多希望我的心能和你的心连在一起，替你承担所有的痛苦与磨难，让你能健康快乐的长大',
        images: [
            {
                src:'images/2024年11月/2024年11月29日/20241129-1.png',
                caption: '温馨时刻'
            },
            {
                src:'images/2024年11月/2024年11月29日/20241129-2.png',
                caption: '温馨时刻'
            },
        ]
    },
    {
        date: '2024年12月21日',
        title: '愉快的玩耍',
        description: '我们一起完成了这张跑酷地图，在很多地方停留，只为找到合适的拍照地方',
        images: [
            {
                src: 'images/2024年12月/2024年12月21日/20241221-1.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年12月/2024年12月21日/20241221-2.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年12月/2024年12月21日/20241221-3.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年12月/2024年12月21日/20241221-4.png',
                caption: '温馨时刻'
            },
            {
                src: 'images/2024年12月/2024年12月21日/20241221-5.png',
                caption: '温馨时刻'
            },
        ]
    },
    {
        date: '2025年1月1日',
        title: '跨年之夜',
        description: '那天我本不能陪你，但我还是来了，尽管是感冒请假吧；那天晚上，我们并没有玩太多的东西，但是我很开心，很幸福，因为有你陪我跨年，陪我度过这个难忘的夜晚',
        images: [
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-1.jpg',
                caption: '跨年时刻'
            },
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-2.jpg',
                caption: '新年愿望'
            },
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-3.jpg',
                caption: '幸福合影'
            },
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-4.jpg',
                caption: '跨年时刻'
            },
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-5.jpg',
                caption: '跨年时刻'
            },
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-6.jpg',
                caption: '跨年时刻'
            },
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-7.jpg',
                caption: '跨年时刻'
            },
            {
                src: 'images/2025年1月/2025年1月1日-跨年夜/20250101-8.jpg',
                caption: '跨年时刻'
            }
        ]
    },
    {
        date: '2025年1月4日',
        title: '我们的幸福',
        description: '那天我们一起去了拍照地图和跑酷，在游玩结束后一起拍了这些照片，我很开心，因为有你陪我，我很幸福，因为有你在身边',
        images: [
            {
                src: 'images/2025年1月/2025年1月4日/20250104-1.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-2.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-3.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-4.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-5.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-6.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-7.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-8.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-9.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-10.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-11.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-12.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-13.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-14.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-15.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-16.png',
                caption: '幸福时刻'
            },
            {
                src: 'images/2025年1月/2025年1月4日/20250104-17.jpg',
                caption: '幸福时刻'
            }
        ]
    },
    {
        date: '2025年1月12日', 
        title: '虚假的圣诞',
        description: '那天我们一起去玩了一张跑酷地图，在这里我们看到了很多，最终战胜了虚假的圣诞老人，取得了胜利',
        images: [
            {
                src: 'images/2025年1月/2025年1月12日/20250112-1.jpg',
                caption: '虚假的圣诞'
            },
            {
                src: 'images/2025年1月/2025年1月12日/20250112-2.jpg',
                caption: '虚假的圣诞'
            },
            {
                src: 'images/2025年1月/2025年1月12日/20250112-3.jpg',
                caption: '虚假的圣诞'
            },
            {
                src: 'images/2025年1月/2025年1月12日/20250112-4.jpg',
                caption: '虚假的圣诞'
            },
            {
                src: 'images/2025年1月/2025年1月12日/20250112-5.jpg',
                caption: '虚假的圣诞'
            },
            {
                src: 'images/2025年1月/2025年1月12日/20250112-6.jpg',
                caption: '虚假的圣诞'
            },
            {
                src: 'images/2025年1月/2025年1月12日/20250112-7.jpg',
                caption: '虚假的圣诞'
            },
            {
                src: 'images/2025年1月/2025年1月12日/20250112-8.jpg',
                caption: '虚假的圣诞'
            }
        ]
    },
    {
        date: '2025年1月16日',
        title: '快乐的一天',
        description: '那天我们一起去了拍照地图和曾经玩过的一张跑酷，在游玩结束后一起拍了这些照片，虽然因为bug，跑酷里我没怎么拍照，但是我还是很开心',
        images: [ 
            {
                src: 'images/2025年1月/2025年1月16日/柳儿视角/20250116-柳-1.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/柳儿视角/20250116-柳-2.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/柳儿视角/20250116-柳-3.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/柳儿视角/20250116-柳-4.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/柳儿视角/20250116-柳-5.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/我的视角/20250116-我-1.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/我的视角/20250116-我-2.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/我的视角/20250116-我-3.jpg',
                caption: '快乐的一天'
            },
            {
                src: 'images/2025年1月/2025年1月16日/我的视角/20250116-我-4.jpg',
                caption: '快乐的一天'
            }
        ]
    },
    {
        date: '2025年1月24日',
        title: '生存和解密',
        description: '那天我们一起去了老版本玩生存，还在新版本玩了一个剧情解密，虽然略带恐怖，但结局有些催泪',
        images: [
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/柳儿视角/20250124-旧版生存-柳-1.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/柳儿视角/20250124-旧版生存-柳-2.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/柳儿视角/20250124-旧版生存-柳-3.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/柳儿视角/20250124-旧版生存-柳-4.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/柳儿视角/20250124-旧版生存-柳-5.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/柳儿视角/20250124-旧版生存-柳-6.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/柳儿视角/20250124-旧版生存-柳-7.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-1.png',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-2.png',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-3.png',
                caption: '生存和解密'
            },
            {
                 src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-4.png',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-5.png',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-6.png',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-7.png',
                caption: '生存和解密'
            }, 
            {
                src: 'images/2025年1月/2025年1月24日/旧版生存/我的视角/20250124-旧版生存-我-8.png',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/谁在敲门/柳儿视角/20250124-谁在敲门-柳-1.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/谁在敲门/柳儿视角/20250124-谁在敲门-柳-2.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/谁在敲门/柳儿视角/20250124-谁在敲门-柳-3.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/谁在敲门/柳儿视角/20250124-谁在敲门-柳-4.jpg',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/谁在敲门/我的视角/20250124-谁在敲门-我-1.png',
                caption: '生存和解密'
            },
            {
                src: 'images/2025年1月/2025年1月24日/谁在敲门/我的视角/20250124-谁在敲门-我-2.png',
                caption: '生存和解密'
            }
        ]
    },
    {
        date: '2025年1月25日',
        title: '520之日',
        description: '今天是我与你相识的第520天，时间过的飞快，但曾经那些一起游戏、互开玩笑还有无限的默契瞬间无比清晰；在危急关头，你总是毫不犹豫的挺身而出，把我护在身后；在极其困难的跑酷中，我们屡屡受挫，但屡败屡战，花费几个小时的时间，虽然疲惫不堪，但是，在成功通关的那一刻，你的激动隔着屏幕便传到了我身上，让我觉得，这一切的付出都是值得的。在游戏中，我们一起看过日出日落，看过夜空流星，看过海洋山丘，看遍了这篇虚拟世界的许多美景，可当我看见你，它们都黯然失色；那些不经意的关心，如同春日暖阳，温暖而又不过张扬；你的关心，是我被怪物围堵攻击时，你杀出重围将我解救；是我为材料发愁时，你不经意间悄悄丢给我；是我情绪低落时，你给予我安慰，让我开心……<br>我曾以为，游戏只是虚拟世界，可她的出现，改变了这一切，这份虚拟世界的感情，却早已跨越了虚拟与现实的界限；它让我在忙碌的生活中，有了一份特别的牵挂，让我的每一天，都充满了无限的期待；它融入了我生活中的点点滴滴，无论是清晨起床时互道早安、催促对方起床，还是夜晚睡前互道晚安，催促入睡，亦或者是其他生活中的点点小事，都让我感到无比安心。<br>感谢你能与我相遇，感谢你让我感受到了，什么是爱，有你，一切似乎都无所谓了',
        images: [
            {
                src: 'images/2025年1月/2025年1月25日/20250125-1.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-2.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-3.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-4.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-5.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-6.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-7.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-8.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-9.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-10.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-11.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-12.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-13.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-14.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-15.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-16.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-17.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-18.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-19.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-20.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-21.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-22.png',
                caption: '520之日'
            },
            {
                src: 'images/2025年1月/2025年1月25日/20250125-23.png',
                caption: '520之日'
            }
        ]
    },
    {
        date: '2025年2月6日',
        title: '旧版生存别墅',
        description: '2025年2月6日，我们一起去完善了旧版生存的别墅，还建了一些装饰物，非常的美观',
        images: [
            {
                src: 'images/2025年2月/2025年2月6日/我的视角/20250206-我-1.png',
                caption: '旧版生存别墅'
            },
            {
                src: 'images/2025年2月/2025年2月6日/我的视角/20250206-我-2.png',
                caption: '旧版生存别墅'
            },
            {
                src: 'images/2025年2月/2025年2月6日/我的视角/20250206-我-3.png',
                caption: '旧版生存别墅'
            },
            {
                src: 'images/2025年2月/2025年2月6日/我的视角/20250206-我-4.png',
                caption: '旧版生存别墅'
            },
            {
                src: 'images/2025年2月/2025年2月6日/柳儿视角/20250206-柳-1.jpg',
                caption: '旧版生存别墅'
            },
            {
                src: 'images/2025年2月/2025年2月6日/柳儿视角/20250206-柳-2.jpg',
                caption: '旧版生存别墅'
            },
            {
                src: 'images/2025年2月/2025年2月6日/柳儿视角/20250206-柳-3.jpg',
                caption: '旧版生存别墅'
            },
            {
                src: 'images/2025年2月/2025年2月6日/柳儿视角/20250206-柳-4.jpg',
                caption: '旧版生存别墅'
            }
        ]
    }
];